Repository: neatek/ClickAuth.net-Wordpress-Plugin
Catalog: lang/*.neatek.clicklogin-*.po
Languages: ru

source: ClickLogin
ru: КликЛогин

source: Authorization
ru: Авторизация

source: You have to authorize via Click Login.<br>Login through the password is restricted.
ru: Вы должны авторизоваться через КликЛогин. <br> Вход через пароль ограничен.

source: Settings
ru: Настройки

source: Donate
ru: Пожертвовать

source: If you like this lightweight plugin and you want more updates for that or new very powerfull plugins.
ru: Если вам нравится этот легкий плагин, и вы хотите получить больше обновлений для него или новых очень мощных плагинов.

source: Author
ru: Автор

source: Vladimir Zhelnov
ru: Владимир Желнов

source: Service
ru: Сервис

source: Do private order (sys. admining, new web-sites, new plugins etc)
ru: Сделать заказ (сис. администрирование, новые сайты, плагины и другое)

source: Data is saved.
ru: Настройки сохранены.

source: Click Login - Plugin doing best authorization
ru: КликЛогин - Делаем авторизацию лучше

source: Here is token for using clicklogin API
ru: Вот токен для использования API clicklogin

source: Token
ru: Токен

source: Changed domain?
ru: Изменился домен?

source: Update
ru: Обновить

source: service token
ru: токен сервиса

source: Or
ru: Или

source: delete
ru: удалить

source: token
ru: токен

source: Here you can disable or enable most of features, what you want
ru: Здесь вы можете отключить или включить большинство функций, что вы хотите

source: Most of options are linked, don't worry if you disable some option - sometimes other options will be enabled or disabled, it's auto-fix.
ru: Большинство параметров связаны, не беспокойтесь, если вы отключите какой-либо вариант - иногда другие параметры будут включены или отключены, это автоматически исправить.

source: Set default
ru: Установить рекомендуемые

source: Save
ru: Сохранить

source: Select available social networks to auth
ru: Выберите доступные социальные сети для авторизации

source: FAQ - Frequently Asked Question
ru: FAQ - Часто задаваемые вопросы

source: What to do if you have not Email in your social page and you can't login back into admin area?
ru: Что делать, если у вас нет электронной почты на вашей социальной странице, и вы не можете войти в зону администрирования?

source: Open folder - /wp-content/plugins/ and rename folder 'ru.neatek.clicklogin' into '.ru.neatek.clicklogin' to disable that plugin, and you can sign in through login&pass again.
ru: Откройте папку - /wp-content/plugins/ и переименуйте папку «ru.neatek.clicklogin» в «.ru.neatek.clicklogin», чтобы отключить этот плагин, и вы можете снова войти в систему через login&pass.

source: How it works?
ru: Как это устроено?

source: It working via Clicklogin.ru service. It will <u>authorizate you in Wordpress via Email</u> that using in your social page.
ru: Он работает через сервис Clicklogin.ru. Он будет <u>авторизовать вас в Wordpress по электронной почте</u>, используя вашу социальную страницу.

source: What does option "Display social auth on admin page"?
ru: Что делает опция «Отображать социальную аутентификацию на странице входа администратора»?

source: It will display ClickLogin authorization on wp login page. I think <a href="/wp-login.php">here</a>.
ru: Плагин отобразит авторизацию ClickLogin на странице входа в wp. Я думаю, <a href="/wp-login.php"> здесь </a>.

source: What does option "Enable shortcodes [fb-auth-link], [vk-auth-link], [google-auth-link], [ok-auth-link]"?
ru: Что такое опция «Включить шорт коды [fb-auth-link], [vk-auth-link], [google-auth-link], [ok-auth-link]"?

source: You can place any of these shortcodes to add link to authorization via clicklogin. Link as [fb-auth-link] or any other.
ru: Вы можете поместить любой из этих шорт кодов, чтобы добавить ссылку на авторизацию через clicklogin. Ссылка как [fb-auth-link] или любой другой.

source: Example
ru: Пример

source: Login via Facebook
ru: Войти через Фейсбук

source: Also you can use them into `themes` in php.
ru: Также вы можете использовать их в `themes` в php.

source: Like here
ru: Как здесь

source: What does option "Disable auth in wp-admin via password (anti-bot feature)"?
ru: Что делает опция «Отключить авторизацию в wp-admin через пароль (функция защиты от ботов)»?

source: It's a great feature. It will disable any tries to authorizate on web-site through login&pass or email&pass. Only Clicklogin authorization will working.
ru: Это отличная функция. Она отключит любые попытки авторизации на веб-сайте через login&pass или email&pass. Будет работать только авторизация Clicklogin.

source: What does option "Enable only (Email & Password) sign in"?
ru: Что означает параметр «Включить только вход через электронную почту и пароль»?

source: It will disable login&pass authorization. I suggest disable all authorizations via passwords.
ru: Она отключит авторизацию через login&pass. Я предлагаю отключить все авторизации с помощью паролей.

source: What does option "Allow to users register on web-site via social pages (as Subscribers)"?
ru: Что делает опция «Разрешить пользователям регистрироваться на веб-сайте через социальные страницы (в качестве подписчиков)»?

source: That plugin will register new users through social pages as subscribers.
ru: Этот плагин будет регистрировать новых пользователей через социальные страницы в качестве подписчиков.

source: What to do if authorization is not working?
ru: Что делать если авторизация не работает?

source: Try to add links like a - /wp-content/plugins/ru.neatek.clicklogin/ru.neatek.clicklogin.auth.php?service=fb_auth to whitelist in .htaccess. It's a public script for doing authorization through this plugin. Also check token, if it isn't empty. if token is empty, try to get it <a target="_blank" href="http://clicklogin.ru/gettoken.html">here</a> (write your domain name like a example.com to input field, and press submit). After all of this your can check php_errors.log file on your hosting, or write to me : neatek@icloud.com
ru: Попробуйте добавить ссылки вида - /wp-content/plugins/ru.neatek.clicklogin/ru.neatek.clicklogin.auth.php?service=fb_auth в белый список .htaccess. Это открытый скрипт для авторизации через этот плагин. Также проверьте токен, если он не пуст. Если токен пуст, попробуйте его получить <a target="_blank" href="http://clicklogin.ru/gettoken.html">здесь</a> (напишите свое доменное имя как example.com для ввода поля и нажмите кнопку «Добавить домен»). После всего этого вы можете проверить файл php_errors.log на своем хостинге или написать мне: neatek@icloud.com

source: Recommended
ru: Рекомендуемые

source: Google.com (World-wide network, no target for years or countries)
ru: Google.com (всемирная сеть, без ограничению по возрасту или по странам)

source: Facebook.com (World-wide network, no target for years or countries)
ru: Facebook.com (всемирная сеть, без ограничению по возрасту или по странам)

source: vk.com (CIS countries, young network for teenagers < 30 years old)
ru: vk.com (страны СНГ, молодая сеть для подростков <30 лет)

source: ok.ru (CIS countries, network for old people > 30 years old)
ru: ok.ru (страны СНГ, сеть для пожилых людей> 30 лет)

source: Display social auth on admin page
ru: Отображать социальную аутентификацию на странице входа администратора

source: Enable shortcodes [fb-auth-link], [vk-auth-link], [google-auth-link], [ok-auth-link]
ru: Включить шорт коды [fb-auth-link], [vk-auth-link], [google-auth-link], [ok-auth-link]

source: Disable auth in wp-admin via password (anti-bot feature)
ru: Отключить авторизацию в wp-admin через пароль (функция защиты от ботов)

source: Enable only (Email & Password) sign in
ru: Включить вход только через адрес электронной почты и пароль

source: Allow to users register on web-site via social pages (as Subscribers)
ru: Разрешить пользователям регистрироваться на веб-сайте через социальные страницы (в качестве подписчиков)

source: Click Login (social auth)
ru: Клик Логин (Авторизация через соц. сети)

source: http://clicklogin.ru/
ru: https://clicklogin.ru/

source: Now, you can sign in via social pages in one click, light and simple plugin for that purpose. Supports: Facebook (fb.com), Google (google.com), VKontakte (vk.com), Odnoklassniki (ok.ru)
ru: Теперь вы можете войти через социальные страницы одним щелчком мыши, легким и простым плагином для этой цели. Поддержка: Facebook (fb.com), Google (google.com), ВКонтакте (vk.com), Одноклассники (ok.ru)

source: Neatek (Vladimir Zhelnov)
ru: Neatek (Владимир Желнов)
